Конфигурация/Documents/ПоказателиОперационнойНадежности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоказателиОперационнойНадежности</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТехнологическиеПроцессы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТехнологическийПроцесс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиОтчетностиЦБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеТехнологическогоПроцесса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродолжительностьВремениРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопустимаяДоляДеградации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопустимоеВремяПростояДеградации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопустимоеСуммарноеВремяПростояДеградации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммарноеВремяПростояДеградации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнформационныеСистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТехнологическийПроцесс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиОтчетностиЦБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяСистема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункциональноеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеИС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТехнологическиеУчастки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиОтчетностиЦБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсточникиДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОператорыСвязи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оператор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭлектронныеАдреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УнифицированныйИдентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресIPv4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресIPv6</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыЮридическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЮридическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Comment>Taxpayer Identification Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРегистрационногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовЮридическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отрасли</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСозданияМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДокументовЮридическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДокументовЮридическихЛиц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОГосударственнойРегистрации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОРегистрации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СертификатОбИнкорпорации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрационныйНомерСтраховщика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПоказателиОперационнойНадежности/Ext/ManagerModule.bsl
Функция СравненииеДанных(ДанныеДляСравнения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ОписаниеТаблиц = Новый Массив;
	ПоместитьВЗапросРезультатСравненияТаблиц(Запрос, ДанныеДляСравнения, ОписаниеТаблиц);
	ПодготовитьРезультатСравненияТаблиц(Запрос, ОписаниеТаблиц);
	
	Возврат ОписаниеТаблиц;
	
КонецФункции	

Процедура ПоместитьТаблицыВЗапрос(Запрос, ДанныеДляСравнения, Суффикс)

	Запрос.Текст = СтрЗаменить(ТекстЗапросаДляСравненияДанных(), "#Суффикс", Суффикс);
	Запрос.УстановитьПараметр("Ссылка",     ДанныеДляСравнения[Суффикс].Ссылка);
	Запрос.УстановитьПараметр("ДатаОтчета", ДанныеДляСравнения[Суффикс].Дата);
	Запрос.Выполнить();
	
	ИмяТаблицыИС = СтрШаблон("_Информационные_Системы_%1", Суффикс);
	
	ТаблицаИС = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, ИмяТаблицыИС).Выгрузить();
	РазвернутьПредставлениеИС(ТаблицаИС);
	
	ЗаменитьВременнуюТаблицу(Запрос, ТаблицаИС, ИмяТаблицыИС); 
	
КонецПроцедуры	

Процедура РазвернутьПредставлениеИС(Таблица)
	
	КолонокВНачале = Таблица.Колонки.Количество();
	
	Таблица.Колонки.Добавить("Техн_Процесс", 							Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Наименование_Автоматизированной_Системы", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Техн_Участок", 							Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Бизнес_Функция", 							Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Функциональное_Значение",             	Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Разработчик_Автоматизированной_Системы", 	Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Уровень_Критичности",                    	Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Системы_Источники_Данных",               	Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Системы_Получатели_Данных",              	Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Наименование_ИТПродукта",                	Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Принадлежность",                         	Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Разработчик_ИТПродукта",                 	Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Класс_Оборудования",                     	Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Класс_Программного_Обеспечения",         	Новый ОписаниеТипов("Строка"));
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		ДанныеПредставленияИС = СтрРазделить(СтрокаТаблицы.ПредставлениеИС, "|");
		Для Ном = КолонокВНачале По Таблица.Колонки.Количество() - 1 Цикл
			
			СтрокаТаблицы[Ном] = ДанныеПредставленияИС[Ном - КолонокВНачале];	
		
		КонецЦикла;	
		
	КонецЦикла;	
	Таблица.Колонки.Удалить(Таблица.Колонки.Индекс(Таблица.Колонки.Найти("ПредставлениеИС")));
	
КонецПроцедуры

Процедура ЗаменитьВременнуюТаблицу(Запрос, Таблица, ИмяТаблицы)
	
	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти(ИмяТаблицы) <> Неопределено Тогда
		Запрос.Текст =	"УНИЧТОЖИТЬ " + ИмяТаблицы + ";" + Символы.ПС;
	КонецЕсли;
	
	Запрос.Текст = СтрШаблон("%1 ВЫБРАТЬ РАЗРЕШЕННЫЕ * ПОМЕСТИТЬ %2 ИЗ &%2 КАК %2", Запрос.Текст, ИмяТаблицы);
	Запрос.УстановитьПараметр(ИмяТаблицы, Таблица);	
	Запрос.Выполнить();
	
КонецПроцедуры	

Процедура ПоместитьВЗапросРезультатСравненияТаблиц(Запрос, ДанныеДляСравнения, ОписаниеТаблиц)
	
	ПоместитьТаблицыВЗапрос(Запрос, ДанныеДляСравнения, "Текущий");
	ПоместитьТаблицыВЗапрос(Запрос, ДанныеДляСравнения, "Предыдущий");
	
	ИменаТаблиц = Новый Массив;
	Для Каждого ВременнаяТаблица Из Запрос.МенеджерВременныхТаблиц.Таблицы Цикл
		
		ИмяТаблицы = СтрЗаменить(ВременнаяТаблица.ПолноеИмя, СтрШаблон("_%1", "Текущий"), "");
		ИмяТаблицы = СтрЗаменить(ИмяТаблицы, СтрШаблон("_%1", "Предыдущий"), "");
		Если ИменаТаблиц.Найти(ИмяТаблицы) = Неопределено Тогда
			
			ИменаТаблиц.Добавить(ИмяТаблицы);
			
		КонецЕсли;	
		
	КонецЦикла;	
	Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
		            
		Оси     = Новый Массив;
		Ресурсы = Новый Массив;
		Таблица = Запрос.МенеджерВременныхТаблиц.Таблицы.Получить(ИмяТаблицы + "_Текущий");
		Для Каждого Колонка Из Таблица.Колонки Цикл

			Если СтрЗаканчиваетсяНа(ВРЕГ(Колонка.Имя), "_ОСЬ") Тогда
				
				Оси.Добавить(Колонка.Имя);
				
			Иначе
				
				Ресурсы.Добавить(Колонка.Имя);
				
			КонецЕсли;
			
		КонецЦикла;
		СистемныеФункции.ПоместитьРезультатСравненияТаблицЗначенийВМенеджерВременныхТаблиц(
			Запрос, 
			ИмяТаблицы + "_Текущий", 
			ИмяТаблицы + "_Предыдущий", 
			ИмяТаблицы + "_Расхождения", 
			Оси);
			
		ТаблицаРасхождений = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, ИмяТаблицы + "_Расхождения").Выгрузить();
		
		Если ТаблицаРасхождений.Количество() Тогда	
			
			ОписаниеТаблиц.Добавить(Новый Структура("ИмяТаблицы, Представление, Оси, Ресурсы", 
				ИмяТаблицы, ПредставлениеИмени(ИмяТаблицы), Оси, Ресурсы));	
				
		КонецЕсли;		
			
	КонецЦикла;	
	
КонецПроцедуры

Функция ПредставлениеИмени(Знач Имя) Экспорт
                                
	Если СтрНачинаетсяС(Имя, "_") Тогда
		
		Имя = Сред(Имя, 2);
		
	КонецЕсли;	
	
	СоставляющиеИмени = СтрРазделить(Имя, "_", Ложь);
	Для Ном = 0 По СоставляющиеИмени.ВГраница() Цикл
		
		Если Ном > 0 Тогда
			
			СоставляющиеИмени[Ном] = НРег(СоставляющиеИмени[Ном]);	
			
		КонецЕсли;	
			
	КонецЦикла;	
	Возврат СтрСоединить(СоставляющиеИмени, " ");
	
КонецФункции	

Процедура ПодготовитьРезультатСравненияТаблиц(Запрос, ОписаниеТаблиц)

	Для Каждого ОписаниеТаблицы Из ОписаниеТаблиц Цикл

		ТаблицаРасхождений = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, ОписаниеТаблицы.ИмяТаблицы + "_Расхождения").Выгрузить();
		ПодготовитьДанныеТаблицыРасхождений(ТаблицаРасхождений, ОписаниеТаблицы);

	КонецЦикла;	
	
КонецПроцедуры	

Процедура ПодготовитьДанныеТаблицыРасхождений(ТаблицаРасхождений, ОписаниеТаблицы)
	
	СтрокиТаблицы = Новый Массив;
	ОписаниеТаблицы.Вставить("СтрокиТаблицы", Новый Массив);
	Для Каждого СтрокаТаблицы Из ТаблицаРасхождений Цикл
		
		ДобавитьСтрокуТаблицыОписаниеТаблицы(ОписаниеТаблицы, СтрокаТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокуТаблицыОписаниеТаблицы(ОписаниеТаблицы, СтрокаТаблицы)
	
	СтрокаТаблицыСтруктурой = Новый Структура;
	СтрокаТаблицыСтруктурой.Вставить("Статус", СтрокаТаблицы["Статус"]);
	ОписаниеТаблицы.СтрокиТаблицы.Добавить(СтрокаТаблицыСтруктурой);
	Для Каждого Ось Из ОписаниеТаблицы.Оси Цикл
		
		СтрокаТаблицыСтруктурой.Вставить(Ось, Строка(СтрокаТаблицы[Ось]));	
		
	КонецЦикла;	
	Для Каждого Ресурс Из ОписаниеТаблицы.Ресурсы Цикл
		
		Если ТипЗнч(СтрокаТаблицы[Ресурс]) = Тип("Число") Тогда
			
			ЗначениеСтрокой  = Формат(СтрокаТаблицы[Ресурс], "ЧГ="); 
			ЗначениеСтрокой2 = Формат(СтрокаТаблицы["_" + Ресурс], "ЧГ="); 
			
		Иначе
			
			ЗначениеСтрокой  = Строка(СтрокаТаблицы[Ресурс]);
			ЗначениеСтрокой2 = Строка(СтрокаТаблицы["_" + Ресурс]);
			
		КонецЕсли;	
		СтрокаТаблицыСтруктурой.Вставить(Ресурс,       ЗначениеСтрокой);	
		СтрокаТаблицыСтруктурой.Вставить("_" + Ресурс, ЗначениеСтрокой2);
		
	КонецЦикла;	

КонецПроцедуры

Функция ТекстЗапросаДляСравненияДанных()

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокПоказателиТехПроцессы.ТехнологическийПроцесс.Код КАК Технологический_Процесс_Ось,
		|	ДокПоказателиТехПроцессы.ОписаниеТехнологическогоПроцесса КАК Описание,
		|	ДокПоказателиТехПроцессы.ПродолжительностьВремениРаботы КАК Продолжительность_Времени_Работы,
		|	ДокПоказателиТехПроцессы.ДопустимаяДоляДеградации КАК Доля_Деградации,
		|	ДокПоказателиТехПроцессы.ДопустимоеВремяПростояДеградации КАК Допустимое_Время_Простоя,
		|	ДокПоказателиТехПроцессы.ДопустимоеСуммарноеВремяПростояДеградации КАК Допустимое_Суммарное_Время_Простоя,
		|	ДокПоказателиТехПроцессы.СуммарноеВремяПростояДеградации КАК Суммарное_Время_Простоя
		|ПОМЕСТИТЬ _Технологические_Процессы_#Суффикс
		|ИЗ
		|	Документ.ПоказателиОперационнойНадежности.ТехнологическиеПроцессы КАК ДокПоказателиТехПроцессы
		|ГДЕ
		|	ДокПоказателиТехПроцессы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокПоказателиОператорыСвязи.Оператор КАК Оператор_Ось,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу, """") КАК Полное_Наименование,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ИНН, """") КАК ИНН,
		|	"""" КАК TIN
		|ПОМЕСТИТЬ _Операторы_Связи_#Суффикс
		|ИЗ
		|	Документ.ПоказателиОперационнойНадежности.ОператорыСвязи КАК ДокПоказателиОператорыСвязи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОтчета,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ДокПоказателиОператорыСвязи.Оператор = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыЮридическихЛиц.СрезПоследних(
		|				&ДатаОтчета,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОГосударственнойРегистрации)) КАК ДокументыЮридическихЛицСрезПоследних
		|		ПО ДокПоказателиОператорыСвязи.Оператор = ДокументыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|			И (ДокументыЮридическихЛицСрезПоследних.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ДокументыЮридическихЛицСрезПоследних.ДействуетПо > &ДатаОтчета)
		|ГДЕ
		|	ДокПоказателиОператорыСвязи.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокПоказателиЭлектронныеАдреса.ДоменноеИмя КАК Доменное_Имя_Ось,
		|	ДокПоказателиЭлектронныеАдреса.УнифицированныйИдентификатор КАК Унифицированный_Идентификатор_Ось,
		|	ДокПоказателиЭлектронныеАдреса.АдресIPv4 КАК АдресIPv4,
		|	ДокПоказателиЭлектронныеАдреса.АдресIPv6 КАК АдресIPv6
		|ПОМЕСТИТЬ _Электронные_Адреса_#Суффикс
		|ИЗ
		|	Документ.ПоказателиОперационнойНадежности.ЭлектронныеАдреса КАК ДокПоказателиЭлектронныеАдреса
		|ГДЕ
		|	ДокПоказателиЭлектронныеАдреса.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокПоказателиТелефоны.Телефон КАК Телефон_Ось,
		|	"""" КАК ТехническаяКолонка
		|ПОМЕСТИТЬ _Телефоны_#Суффикс
		|ИЗ
		|	Документ.ПоказателиОперационнойНадежности.Телефоны КАК ДокПоказателиТелефоны
		|ГДЕ
		|	ДокПоказателиТелефоны.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦентрыОбработкиДанных.ЦентрОбработкиДанных КАК Центр_Обработки_Данных_Ось,
		|	ЦентрыОбработкиДанных.ЦентрОбработкиДанных.КодФункциональности КАК Код_Функциональности,
		|	ЦентрыОбработкиДанных.ЦентрОбработкиДанных.КодКатегорииОблачныхРешений КАК Код_Категории_Облачных_Решений,
		|	ВЫРАЗИТЬ(ЦентрыОбработкиДанных.ЦентрОбработкиДанных.Адрес КАК СТРОКА(300)) КАК Адрес,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу, """") КАК Наименование,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ИНН, """") КАК ИНН,
		|	"""" КАК TIN,
		|	ЦентрыОбработкиДанных.ЦентрОбработкиДанных.Сертификация КАК Сертификация,
		|	ЦентрыОбработкиДанных.ЦентрОбработкиДанных.НаличиеSLA КАК НаличиеSLA,
		|	ЦентрыОбработкиДанных.ЦентрОбработкиДанных.Надежность КАК Надежность
		|ПОМЕСТИТЬ _Центры_Обработки_Данных_#Суффикс
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ДокПоказателиИнформационныеСистемы.ИнформационнаяСистема.ЦентрОбработкиДанных КАК ЦентрОбработкиДанных
		|	ИЗ
		|		Документ.ПоказателиОперационнойНадежности.ИнформационныеСистемы КАК ДокПоказателиИнформационныеСистемы
		|	ГДЕ
		|		ДокПоказателиИнформационныеСистемы.Ссылка = &Ссылка) КАК ЦентрыОбработкиДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОтчета,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ЦентрыОбработкиДанных.ЦентрОбработкиДанных.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокПоказателиИнформационныеСистемы.ТехнологическийПроцесс.Код КАК Технологический_Процесс_Ось,
		|	ДокПоказателиИнформационныеСистемы.ИнформационнаяСистема КАК Информационная_Система_Ось,
		|	ДокПоказателиИнформационныеСистемы.ПредставлениеИС КАК ПредставлениеИС
		|ПОМЕСТИТЬ _Информационные_Системы_#Суффикс
		|ИЗ
		|	Документ.ПоказателиОперационнойНадежности.ИнформационныеСистемы КАК ДокПоказателиИнформационныеСистемы
		|ГДЕ
		|	ДокПоказателиИнформационныеСистемы.Ссылка = &Ссылка";
	
	 Возврат ТекстЗапроса;
	
КонецФункции

Функция ДокументыДляСравнения(ДокументТекущегоПериода) Экспорт
	
	Результат = Новый Структура("Текущий, Предыдущий", Новый Структура("Ссылка, Дата"), Новый Структура("Ссылка, Дата")); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументТекущегоПериода);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоказателиОперационнойНадежности.Ссылка КАК Текущий,
		|	ПоказателиОперационнойНадежности.Дата КАК ТекущийДата,
		|	ЕСТЬNULL(ДокиПредыдущегоПериода.Документ, ЗНАЧЕНИЕ(Документ.ПоказателиОперационнойНадежности.ПустаяСсылка)) КАК Предыдущий,
		|	ЕСТЬNULL(ДокиПредыдущегоПериода.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ПредыдущийДата
		|ИЗ
		|	Документ.ПоказателиОперационнойНадежности КАК ПоказателиОперационнойНадежности
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
		|			ПоказателиОперационнойНадежности.Ссылка КАК Документ,
		|			ПоказателиОперационнойНадежности.Ссылка.Дата КАК Дата
		|		ИЗ
		|			Документ.ПоказателиОперационнойНадежности КАК ПоказателиОперационнойНадежности
		|		ГДЕ
		|			ПоказателиОперационнойНадежности.Организация = ВЫРАЗИТЬ(&Ссылка КАК Документ.ПоказателиОперационнойНадежности).Организация
		|			И НЕ ПоказателиОперационнойНадежности.ПометкаУдаления
		|			И КОНЕЦПЕРИОДА(ПоказателиОперационнойНадежности.Дата, ДЕНЬ) = КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(&Ссылка КАК Документ.ПоказателиОперационнойНадежности).Дата, МЕСЯЦ, -3), КВАРТАЛ)) КАК ДокиПредыдущегоПериода
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ПоказателиОперационнойНадежности.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Результат.Текущий.Ссылка    = Выборка.Текущий;
		Результат.Текущий.Дата      = Выборка.ТекущийДата;
		Результат.Предыдущий.Ссылка = Выборка.Предыдущий;
		Результат.Предыдущий.Дата   = Выборка.ПредыдущийДата;
		
	КонецЕсли;	
	Возврат Результат;
	
КонецФункции
